mrodriguezme/alarm_clock/src/board/mcu/MSPM0C1105_C1106.svd
                <register>
                    <name>FLASHCTL_CMDCTL</name>
                    <description>Command Control Register</description>
                    <addressOffset>0x1108</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>MODESEL</name>
                            <description>Mode
This field is only used for the Mode Change command type.  Otherwise, bank
and pump modes are set automaticlly through the NW hardware.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x4</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>READ</name>
                                        <description>Read Mode</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>RDMARG0</name>
                                        <description>Read Margin 0 Mode</description>
                                        <value>0x2</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>RDMARG1</name>
                                        <description>Read Margin 1 Mode</description>
                                        <value>0x4</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>RDMARG0B</name>
                                        <description>Read Margin 0B Mode</description>
                                        <value>0x6</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>RDMARG1B</name>
                                        <description>Read Margin 1B Mode</description>
                                        <value>0x7</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>PGMVER</name>
                                        <description>Program Verify Mode</description>
                                        <value>0x9</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>PGMSW</name>
                                        <description>Program Single Word</description>
                                        <value>0xA</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ERASEVER</name>
                                        <description>Erase Verify Mode</description>
                                        <value>0xB</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ERASESECT</name>
                                        <description>Erase Sector</description>
                                        <value>0xC</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>PGMMW</name>
                                        <description>Program Multiple Word</description>
                                        <value>0xE</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ERASEBNK</name>
                                        <description>Erase Bank</description>
                                        <value>0xF</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>REGIONSEL</name>
                            <description>Bank Region
A specific region ID can be written to this field to indicate to which region an 
operation is to be applied if CMDCTL.ADDRXLATEOVR is set.</description>
                            <bitOffset>0x9</bitOffset>
                            <bitWidth>0x4</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>MAIN</name>
                                        <description>Main Region</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>NONMAIN</name>
                                        <description>Non-Main Region</description>
                                        <value>0x2</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>TRIM</name>
                                        <description>Trim Region</description>
                                        <value>0x4</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ENGR</name>
                                        <description>Engr Region</description>
                                        <value>0x8</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>ADDRXLATEOVR</name>
                            <description>Override hardware address translation of address in CMDADDR from a 
system address to a bank address and bank ID.  Use data written to 
CMDADDR directly as the bank address.  Use the value written to 
CMDCTL.BANKSEL directly as the bank ID.  Use the value written to
CMDCTL.REGIONSEL directly as the region ID.</description>
                            <bitOffset>0x10</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>NOOVERRIDE</name>
                                        <description>Do not override</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>OVERRIDE</name>
                                        <description>Override</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>SSERASEDIS</name>
                            <description>Disable Stair-Step Erase.  If set, the default VHV trim voltage setting will be used
for all erase pulses.
By default, this bit is reset, meaning that the VHV voltage will be stepped during
successive erase pulses.  The step count, step voltage, begin and end voltages
are all hard-wired.</description>
                            <bitOffset>0x14</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>ENABLE</name>
                                        <description>Enable</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>DISABLE</name>
                                        <description>Disable</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>DATAVEREN</name>
                            <description>Enable invalid data verify.  
This checks for 0-&gt;1 transitions in the memory when
a program operation is initiated.  If such a transition is found, the program will
fail with an error without executing the program.</description>
                            <bitOffset>0x15</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>read-write</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>DISABLE</name>
                                        <description>Disable</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>ENABLE</name>
                                        <description>Enable</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                    </fields>
                </register>
                <register>
                    <name>FLASHCTL_CMDADDR</name>
                    <description>Command Address Register</description>
                    <addressOffset>0x1120</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>VAL</name>
                            <description>Address value</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x20</bitWidth>
                            <access>read-write</access>
                            </field>
                    </fields>
                </register>
                <register>
                    <name>FLASHCTL_CMDBYTEN</name>
                    <description>Command Program Byte Enable Register</description>
                    <addressOffset>0x1124</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>VAL</name>
                            <description>Command Byte Enable value.
A 1-bit per flash word byte value is placed in this register.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x8</bitWidth>
                            <access>read-write</access>
                            </field>
                    </fields>
                </register>
                <register>
                    <name>FLASHCTL_CMDDATA0</name>
                    <description>Command Data Register 0</description>
                    <addressOffset>0x1130</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>VAL</name>
                            <description>A 32-bit data value is placed in this field.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x20</bitWidth>
                            <access>read-write</access>
                            </field>
                    </fields>
                </register>
                <register>
                    <name>FLASHCTL_CMDDATA1</name>
                    <description>Command Data Register 1</description>
                    <addressOffset>0x1134</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>VAL</name>
                            <description>A 32-bit data value is placed in this field.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x20</bitWidth>
                            <access>read-write</access>
                            </field>
                    </fields>
                </register>
                <register>
                    <name>FLASHCTL_CMDWEPROTA</name>
                    <description>Command Write Erase Protect A Register</description>
                    <addressOffset>0x11D0</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>VAL</name>
                            <description>Each bit protects 1 sector.

bit [0]:	When 1, sector 0 of the flash memory will be protected from program
		and erase.
bit [1]:	When 1, sector 1 of the flash memory will be protected from program
		and erase.
	:
	:
bit [31]:	When 1, sector 31 of the flash memory will be protected from program
		and erase.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x20</bitWidth>
                            <access>read-write</access>
                            </field>
                    </fields>
                </register>
                <register>
                    <name>FLASHCTL_CMDWEPROTB</name>
                    <description>Command Write Erase Protect B Register</description>
                    <addressOffset>0x11D4</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>VAL</name>
                            <description>Each bit protects a group of 8 sectors.  When a bit is 1, the associated 8 sectors
in the flash will be protected from program and erase.  A maximum of 256
sectors can be protected with this register.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x8</bitWidth>
                            <access>read-write</access>
                            </field>
                    </fields>
                </register>
                <register>
                    <name>FLASHCTL_CMDWEPROTNM</name>
                    <description>Command Write Erase Protect Non-Main Register</description>
                    <addressOffset>0x1210</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>VAL</name>
                            <description>Each bit protects 1 sector.

bit [0]:	When 1, sector 0 of the non-main region will be protected from program
		and erase.
bit [1]:	When 1, sector 1 of the non-main region will be protected from program
		and erase.
	:
	:
bit [31]:	When 1, sector 31 of the non-main will be protected from program
		and erase.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x2</bitWidth>
                            <access>read-write</access>
                            </field>
                    </fields>
                </register>
                <register>
                    <name>FLASHCTL_CMDWEPROTTR</name>
                    <description>Command Write Erase Protect Trim Register</description>
                    <addressOffset>0x1214</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <fields>
                        <field>
                            <name>VAL</name>
                            <description>Each bit protects 1 sector.

