mrodriguezme/alarm_clock/src/board/mcu/MSPM0C1105_C1106.svd
                <cluster>
                    <dim>1</dim>
                    <dimIncrement>44</dimIncrement>
                    <dimArrayIndex>0</dimArrayIndex>
                    <name>I2C0_CPU_INT[%s]</name>
                    <description></description>
                    <addressOffset>0x1020</addressOffset>
                    <register>
                        <name>I2C0_CPU_INT_IIDX</name>
                        <description>Interrupt index</description>
                        <addressOffset>0x0</addressOffset>
                        <size>32</size>
                        <access>read-only</access>
                        <resetValue>0x00000000</resetValue>
                        <fields>
                            <field>
                                <name>STAT</name>
                                <description>I2C Module Interrupt Vector Value.  This register provides the highes priority interrupt index. A read clears the corresponding interrupt flag in RIS and MISC. 15h-1Fh = Reserved</description>
                                <bitOffset>0x0</bitOffset>
                                <bitWidth>0x8</bitWidth>
                                <access>read-only</access>
                                <enumeratedValues>
                                        <enumeratedValue>
                                            <name>NO_INTR</name>
                                            <description>No interrupt pending</description>
                                            <value>0x0</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>CRXDONEFG</name>
                                            <description>Controller data received</description>
                                            <value>0x1</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>CTXDONEFG</name>
                                            <description>Controller data transmitted</description>
                                            <value>0x2</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>CRXFIFOTRG</name>
                                            <description>Controller receive FIFO Trigger Level</description>
                                            <value>0x3</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>CTXFIFOTRG</name>
                                            <description>Controller transmit FIFO Trigger level</description>
                                            <value>0x4</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>CRXFIFOFULL</name>
                                            <description>RX FIFO FULL Event/interrupt pending</description>
                                            <value>0x5</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>CTX_EMPTY</name>
                                            <description>Transmit FIFO/Buffer Empty Event/interrupt pending</description>
                                            <value>0x6</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>CNACKFG</name>
                                            <description>Address/Data NACK</description>
                                            <value>0x8</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>CSTARTFG</name>
                                            <description>Start Event</description>
                                            <value>0x9</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>CSTOPFG</name>
                                            <description>Stop Event</description>
                                            <value>0xA</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>CARBLOSTFG</name>
                                            <description>Arbitration Lost</description>
                                            <value>0xB</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>CDMA_DONE_TX</name>
                                            <description>DMA DONE on Channel TX</description>
                                            <value>0xC</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>CDMA_DONE_RX</name>
                                            <description>DMA DONE on Channel RX</description>
                                            <value>0xD</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>CPEC_RX_ERR</name>
                                            <description>Controller PEC Receive Error Event</description>
                                            <value>0xE</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>TIMEOUTA</name>
                                            <description>Timeout A Event</description>
                                            <value>0xF</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>TIMEOUTB</name>
                                            <description>Timeout B Event</description>
                                            <value>0x10</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>TRXDONEFG</name>
                                            <description>Target Data Event</description>
                                            <value>0x11</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>TTXDONEFG</name>
                                            <description>Target Data Event</description>
                                            <value>0x12</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>TRXFIFOTRG</name>
                                            <description>Target receive FIFO Trigger Level</description>
                                            <value>0x13</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>TTXFIFOTRG</name>
                                            <description>Target transmit FIFO Trigger level</description>
                                            <value>0x14</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>TRXFIFOFULL</name>
                                            <description>RX FIFO FULL Event/interrupt pending</description>
                                            <value>0x15</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>TTXEMPTY</name>
                                            <description>Transmit FIFO/Buffer Empty Event/interrupt pending</description>
                                            <value>0x16</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>TSTARTFG</name>
                                            <description>Start Event</description>
                                            <value>0x17</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>TSTOPFG</name>
                                            <description>Stop Event</description>
                                            <value>0x18</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>TGENCALL</name>
                                            <description>General Call Event</description>
                                            <value>0x19</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>TDMA_DONE_TX</name>
                                            <description>DMA DONE on Channel TX</description>
                                            <value>0x1A</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>TDMA_DONE_RX</name>
                                            <description>DMA DONE on Channel RX</description>
                                            <value>0x1B</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>TPEC_RX_ERR</name>
                                            <description>Target PEC receive error event</description>
                                            <value>0x1C</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>TTX_UNFL</name>
                                            <description>Target TX FIFO underflow</description>
                                            <value>0x1D</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>TRX_OVFL</name>
                                            <description>Target RX FIFO overflow event</description>
                                            <value>0x1E</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>TARBLOST</name>
                                            <description>Target arbitration lost event</description>
                                            <value>0x1F</value>
                                        </enumeratedValue>
                                        <enumeratedValue>
                                            <name>INTR_OVFL</name>
                                            <description>Interrupt overflow event</description>
                                            <value>0x20</value>
                                        </enumeratedValue>
                                    </enumeratedValues>
                                </field>
                        </fields>
                    </register>
