mrodriguezme/alarm_clock/src/board/mcu/MSPM0C1105_C1106.svd
                <register>
                    <name>SYSCTL_BORCLRCMD</name>
                    <description>Set the BOR threshold</description>
                    <addressOffset>0x130C</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xff000001</resetMask>
                    <fields>
                        <field>
                            <name>GO</name>
                            <description>GO clears any prior BOR violation status indications and attempts to change the active BOR mode to that specified in the LEVEL field of the BORTHRESHOLD register.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>write-only</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>TRUE</name>
                                        <description>Issue clear</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                    </fields>
                </register>
                <register>
                    <name>SYSCTL_SYSOSCFCLCTL</name>
                    <description>SYSOSC frequency correction loop (FCL) ROSC enable</description>
                    <addressOffset>0x1310</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xff000001</resetMask>
                    <fields>
                        <field>
                            <name>SETUSEFCL</name>
                            <description>Set SETUSEFCL to enable the frequency correction loop in SYSOSC.  Once enabled, this state is locked until the next BOOTRST.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>write-only</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>TRUE</name>
                                        <description>Enable the SYSOSC FCL</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                    </fields>
                </register>
                <register>
                    <name>SYSCTL_LFXTCTL</name>
                    <description>LFXT and LFCLK control</description>
                    <addressOffset>0x1314</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xff000003</resetMask>
                    <fields>
                        <field>
                            <name>SETUSELFXT</name>
                            <description>Set SETUSELFXT to switch LFCLK to LFXT.  Once set, SETUSELFXT remains set until the next BOOTRST.</description>
                            <bitOffset>0x1</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>write-only</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>FALSE</name>
                                        <description></description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>TRUE</name>
                                        <description>Use LFXT as the LFCLK source</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                        <field>
                            <name>STARTLFXT</name>
                            <description>Set STARTLFXT to start the low frequency crystal oscillator (LFXT).  Once set, STARTLFXT remains set until the next BOOTRST.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>write-only</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>FALSE</name>
                                        <description>LFXT not started</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>TRUE</name>
                                        <description>Start LFXT</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                    </fields>
                </register>
                <register>
                    <name>SYSCTL_EXLFCTL</name>
                    <description>LFCLK_IN and LFCLK control</description>
                    <addressOffset>0x1318</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xff000001</resetMask>
                    <fields>
                        <field>
                            <name>SETUSEEXLF</name>
                            <description>Set SETUSEEXLF to switch LFCLK to the LFCLK_IN digital clock input.  Once set, SETUSEEXLF remains set until the next BOOTRST.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>write-only</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>TRUE</name>
                                        <description>Use LFCLK_IN as the LFCLK source</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                    </fields>
                </register>
                <register>
                    <name>SYSCTL_SHDNIOREL</name>
                    <description>SHUTDOWN IO release control</description>
                    <addressOffset>0x131C</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xff000001</resetMask>
                    <fields>
                        <field>
                            <name>RELEASE</name>
                            <description>Set RELEASE to release the IO after a SHUTDOWN mode exit.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>write-only</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>TRUE</name>
                                        <description>Release IO</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                    </fields>
                </register>
                <register>
                    <name>SYSCTL_EXRSTPIN</name>
                    <description>Disable the reset function of the NRST pin</description>
                    <addressOffset>0x1320</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xff000001</resetMask>
                    <fields>
                        <field>
                            <name>DISABLE</name>
                            <description>Set DISABLE to disable the reset function of the NRST pin.  Once set, this configuration is locked until the next POR.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>write-only</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>FALSE</name>
                                        <description>Reset function of NRST pin is enabled</description>
                                        <value>0x0</value>
                                    </enumeratedValue>
                                    <enumeratedValue>
                                        <name>TRUE</name>
                                        <description>Reset function of NRST pin is disabled</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                    </fields>
                </register>
                <register>
                    <name>SYSCTL_SYSSTATUSCLR</name>
                    <description>Clear sticky bits of SYSSTATUS</description>
                    <addressOffset>0x1324</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xff000001</resetMask>
                    <fields>
                        <field>
                            <name>ALLECC</name>
                            <description>Set ALLECC to clear all ECC related SYSSTATUS indicators.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>write-only</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>CLEAR</name>
                                        <description>Clear ECC error state</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                    </fields>
                </register>
                <register>
                    <name>SYSCTL_SWDCFG</name>
                    <description>Disable the SWD function on the SWD pins</description>
                    <addressOffset>0x1328</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xff000001</resetMask>
                    <fields>
                        <field>
                            <name>DISABLE</name>
                            <description>Set DISABLE to disable the SWD function on SWD pins, allowing the SWD pins to be used as GPIO.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>write-only</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>TRUE</name>
                                        <description>Disable SWD function on SWD pins</description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                    </fields>
                </register>
                <register>
                    <name>SYSCTL_FCCCMD</name>
                    <description>Frequency clock counter start capture</description>
                    <addressOffset>0x132C</addressOffset>
                    <size>32</size>
                    <access>write-only</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xff000001</resetMask>
                    <fields>
                        <field>
                            <name>GO</name>
                            <description>Set GO to start a capture with the frequency clock counter (FCC).</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x1</bitWidth>
                            <access>write-only</access>
                            <enumeratedValues>
                                    <enumeratedValue>
                                        <name>TRUE</name>
                                        <description></description>
                                        <value>0x1</value>
                                    </enumeratedValue>
                                </enumeratedValues>
                            </field>
                    </fields>
                </register>
                <register>
                    <name>SYSCTL_SHUTDNSTORE0</name>
                    <description>Shutdown storage memory (byte 0)</description>
                    <addressOffset>0x1400</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x000003ff</resetMask>
                    <fields>
                        <field>
                            <name>DATA</name>
                            <description>Shutdown storage byte 0</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x8</bitWidth>
                            <access>read-write</access>
                            </field>
                    </fields>
                </register>
                <register>
                    <name>SYSCTL_SHUTDNSTORE1</name>
                    <description>Shutdown storage memory (byte 1)</description>
                    <addressOffset>0x1404</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x000003ff</resetMask>
                    <fields>
                        <field>
                            <name>DATA</name>
                            <description>Shutdown storage byte 1</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x8</bitWidth>
                            <access>read-write</access>
                            </field>
                    </fields>
                </register>
                <register>
                    <name>SYSCTL_SHUTDNSTORE2</name>
                    <description>Shutdown storage memory (byte 2)</description>
                    <addressOffset>0x1408</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x000003ff</resetMask>
                    <fields>
                        <field>
                            <name>DATA</name>
                            <description>Shutdown storage byte 2</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x8</bitWidth>
                            <access>read-write</access>
                            </field>
                    </fields>
                </register>
                <register>
                    <name>SYSCTL_SHUTDNSTORE3</name>
                    <description>Shutdown storage memory (byte 3)</description>
                    <addressOffset>0x140C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x000003ff</resetMask>
                    <fields>
                        <field>
                            <name>DATA</name>
                            <description>Shutdown storage byte 3</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x8</bitWidth>
                            <access>read-write</access>
                            </field>
                    </fields>
                </register>
                <register>
                    <name>SYSCTL_FWEPROTMAIN</name>
                    <description>1 Sector Write-Erase per bit starting at address 0x0 of flash</description>
                    <addressOffset>0x3000</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                    </fields>
                </register>
                <register>
                    <name>SYSCTL_FRXPROTMAINSTART</name>
                    <description>Flash RX Protection Start Address</description>
                    <addressOffset>0x3018</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x003fffc0</resetMask>
                    <fields>
                        <field>
                            <name>ADDR</name>
                            <description>Flash RX Protection Start Address 64B granularity</description>
                            <bitOffset>0x6</bitOffset>
                            <bitWidth>0x10</bitWidth>
                            <access>read-write</access>
                            </field>
                    </fields>
                </register>
                <register>
                    <name>SYSCTL_FRXPROTMAINEND</name>
                    <description>Flash RX Protection End Address</description>
                    <addressOffset>0x301C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x003fffc0</resetMask>
                    <fields>
                        <field>
                            <name>ADDR</name>
                            <description>Flash RX Protection End Address 64B granularity</description>
                            <bitOffset>0x6</bitOffset>
                            <bitWidth>0x10</bitWidth>
                            <access>read-write</access>
                            </field>
                    </fields>
                </register>
                <register>
                    <name>SYSCTL_FIPPROTMAINSTART</name>
                    <description>Flash IP Protection Start Address</description>
                    <addressOffset>0x3020</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x003fffc0</resetMask>
                    <fields>
                        <field>
                            <name>ADDR</name>
                            <description>Flash IP Protection Start Address 64B granularity</description>
                            <bitOffset>0x6</bitOffset>
                            <bitWidth>0x10</bitWidth>
                            <access>read-write</access>
                            </field>
                    </fields>
                </register>
                <register>
                    <name>SYSCTL_FIPPROTMAINEND</name>
                    <description>Flash IP Protection End Address</description>
                    <addressOffset>0x3024</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0x003fffc0</resetMask>
                    <fields>
                        <field>
                            <name>ADDR</name>
                            <description>Flash IP Protection End Address 64B granularity</description>
                            <bitOffset>0x6</bitOffset>
                            <bitWidth>0x10</bitWidth>
                            <access>read-write</access>
                            </field>
                    </fields>
                </register>
