mrodriguezme/alarm_clock/src/board/mcu/MSPM0C1105_C1106.svd
            </registers>
        </peripheral>
        <peripheral>
            <name>ADC0_SVT</name>
            <groupName>ADC</groupName>
            <version>1.0</version>
            <description>PERIPHERALREGIONSVT</description>
            <baseAddress>0x4055A000</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x1000</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>ADC0_SVT_FIFODATA</name>
                    <description>FIFO Data Register</description>
                    <addressOffset>0x556160</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <fields>
                    </fields>
                </register>
                <register>
                    <dim>12</dim>
                    <dimIncrement>4</dimIncrement>
                    <dimArrayIndex>0,1,2,3,4,5,6,7,8,9,10,11</dimArrayIndex>
                    <name>ADC0_SVT_MEMRES[%s]</name>
                    <description>Memory Result Register</description>
                    <addressOffset>0x556280</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <fields>
                        <field>
                            <name>DATA</name>
                            <description>MEMRES result register.
If DF = 0, unsigned binary:
The conversion results are right aligned. In 10 and 8 bit modes, the unused MSB bits are forced to 0. 
If DF = 1, 2s-complement format:
The conversion results are left aligned. In 10 and 8 bit modes, the unused LSB bits are forced to 0.
The data is stored in the right-justified format and is converted to the left-justified 2s-complement format during read back.</description>
                            <bitOffset>0x0</bitOffset>
                            <bitWidth>0x10</bitWidth>
                            </field>
                    </fields>
                </register>
            </registers>
        </peripheral>

   </peripherals>
</device>

